# CannotDeleteEditedElement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotDeleteEditedElement Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't delete element that is being edited.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDeleteEditedElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDeleteEditedElement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDeleteEditedElement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace